tests/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 2
      name: "Warm up"
    - duration: 120
      arrivalRate: 5
      name: "Sustained load"
  processor: "./load-test-functions.js"
scenarios:
  - name: "Get user profile"
    flow:
      - function: "generateRequest"
        params:
          method: "callTool"
          toolName: "get_user_profile"
          arguments:
            username: "twitter"
      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            id: "{{ id }}"
            method: "{{ method }}"
            params:
              name: "{{ toolName }}"
              arguments: "{{ arguments }}"
  - name: "Search tweets"
    flow:
      - function: "generateRequest"
        params:
          method: "callTool"
          toolName: "search_tweets"
          arguments:
            query: "artificial intelligence"
            count: 5
      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            id: "{{ id }}"
            method: "{{ method }}"
            params:
              name: "{{ toolName }}"
              arguments: "{{ arguments }}"
  - name: "Get user tweets"
    flow:
      - function: "generateRequest"
        params:
          method: "callTool"
          toolName: "get_user_tweets"
          arguments:
            username: "elonmusk"
            count: 5
      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            id: "{{ id }}"
            method: "{{ method }}"
            params:
              name: "{{ toolName }}"
              arguments: "{{ arguments }}"